{
  "header": {
    "navlinks": {
      "home": "Home",
      "about": "About",
      "experience": "Experience",
      "technologies": "Technologies",
      "projects": "Projects",
      "contact": "Contact"
    }
  },
  "home": {
    "title": "Federico Avelin",
    "subtitle": "Fullstack Web Developer",
    "description": "Passionate about building quality software. My focus is on solid architecture, clean code, and the delivery of tangible value through modern web technology.",
    "chat": "Let's Chat"
  },
  "about": {
    "title": "About Me",
    "description": "Hi! I'm Federico, a full-stack web developer with {years} years of experience dedicated to building incredible web experiences.\n\nI love transforming ideas into digital reality, paying special attention to code quality and usability. I work comfortably with HTML, CSS, TypeScript, React, Next.js, and Tailwind CSS, and I really enjoy discovering and using new tools that improve my work.\n\nIf you have a project in mind, I'd love to chat and see how I can help you bring it to life!",
    "downloadCv": "Download CV"
  },
  "experience": {
    "title": "Experience",
    "items": {
      "generator": {
        "company": "Litebox",
        "position": "@ Frontend Developer",
        "description": "I updated an internal utility for generating Frontend and Backend projects. New scripts and configurations were added to enable automatic dependency updates, using the latest recommended ESLint configurations and simplifying the tool's usage with npx.",
        "time": "Apr. 2025"
      },
      "stellar": {
        "company": "Litebox",
        "position": "@ Frontend Developer",
        "description": "I implemented offline support in the application for marina administrators, allowing access to key functionalities without an internet connection and improving the user experience in situations with limited connectivity. I also configured the application to be used as a PWA and installed on mobile devices thanks to PWABuilder. For this, technologies such as Tanstack Query were used for offline mutation management, Service Workers for resource caching, and React and Next.js for the Frontend.",
        "time": "Mar. 2024 - Apr. 2025"
      },
      "molo": {
        "company": "Litebox",
        "position": "@ Frontend Developer",
        "description": "I optimized application performance in sections with extensive forms (more than 50 fields) by using React Hook Forms and custom validations, which improved data collection efficiency. Additionally, infinite tables were optimized by implementing virtualization and scroll pagination techniques for better performance. Tanstack Virtual and Tanstack Query were used.",
        "time": "Jun. 2022 - Feb. 2024"
      },
      "sofia": {
        "company": "Litebox",
        "position": "@ Full Stack Developer",
        "description": "I developed the integration of Algolia for product search, significantly improving the user experience by enabling fast and efficient searches for one of the leading e-commerce companies in Bolivia. Technologies used: Express, React, SQL, MySQL, Next.js, GraphQL.",
        "time": "Mar. - May 2022"
      },
      "liteboxWebsite": {
        "company": "Litebox",
        "position": "@ Frontend Developer",
        "description": "I developed a complex carousel with Vue.js and CSS, facing challenges in animations and UI/UX requirements. After analyzing various libraries, Splide.js was implemented, significantly customizing it with CSS to meet design and user experience specifications, achieving fluid animations and custom behavior.",
        "time": "Feb. 2022"
      }
    }
  },
  "technologies": {
    "title": "Technologies",
    "categories": {
      "coreWeb": "Core Web & Styling",
      "javascriptEcosystem": "Javascript Ecosystem & Libraries",
      "backend": "Backend & Fullstack",
      "tools": "Development Tools & Environment"
    },
    "icons": {
      "css": "CSS",
      "docker": "Docker",
      "express": "Express",
      "git": "Git",
      "html": "HTML",
      "javascript": "JavaScript",
      "linux": "Linux",
      "materialUI": "Material UI",
      "nextjs": "Next.js",
      "node": "Node.js",
      "npm": "npm",
      "postgresql": "PostgreSQL",
      "postman": "Postman",
      "pwa": "PWA",
      "react": "React",
      "reactHookForm": "React Hook Form",
      "styledComponents": "Styled Components",
      "tailwind": "Tailwind",
      "tanstack": "Tanstack",
      "typescript": "TypeScript",
      "vite": "Vite"
    }
  },
  "contact": {
    "title": "Contact Me",
    "info": {
      "location": "Rosario, Santa Fe, Argentina",
      "email": "fede.avelin.dev@gmail.com",
      "github": "github.com/fedex159",
      "linkedin": "linkedin.com/in/federico-avelin-dev/"
    },
    "form": {
      "fullName": "Full Name*",
      "email": "Email*",
      "subject": "Subject*",
      "message": "Message*",
      "submit": "Submit",
      "submitting": "Submitting...",
      "validation": {
        "required": "Required*",
        "email": "Invalid email format",
        "min": "Minimum {min} characters"
      },
      "success": {
        "title": "Successful",
        "message": "Your message has been sent successfully."
      },
      "error": {
        "title": "Error",
        "message": "There was an error sending your message. Please try again later."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "links": {
      "repository": "Repository",
      "website": "Website"
    },
    "items": {
      "webService": {
        "title": "Web Service",
        "description": "It's a final degree e-commerce project to connect the supply and demand of services (plumbing, classes, etc.). I led the team in the organization and development of the project.\n\nIt offers service publication, a rating system, a shopping cart with payments (MercadoPago/PayPal), and real-time chat. It includes user and administrator panels with statistics.\n\nDeveloped with React, Express, PostgreSQL, and Material UI, we implemented complete functionalities including authentication. It's a fully functional study project."
      },
      "videogames": {
        "title": "Videogames",
        "description": "Was an individual final degree project that consisted of developing a web application for searching and managing video games.\n\nIt offers search and filtering of video games (using the RAWG API), creation of new video games, pagination, and a detail page. It is also responsive.\n\nDeveloped with React, Express, and PostgreSQL, this individual project was crucial for my full-stack learning and the integration of APIs like the RAWG API."
      },
      "snake": {
        "title": "Snake React",
        "description": "It's a recreation of the classic Snake video game, developed as a personal challenge to explore React's capabilities in creating interactive game logic.\n\nIt offers three difficulty levels, sound effects, and is fully responsive, working on desktop and mobile devices with touch controls or buttons.\n\nWith a simple design, the main focus was the challenging implementation of the game logic in React, resulting in a valuable learning experience."
      },
      "gifs": {
        "title": "Gif Finder",
        "description": "Gifs app. Some of the main functions are: GIF search, color selector, add to favorites, carousel."
      },
      "porfolio": {
        "title": "Portfolio",
        "description": "My personal portfolio. Made with React and Typescript. You will find my personal information, projects and technologies."
      },
      "liteflix": {
        "title": "Liteflix",
        "description": "Dynamic movie catalog. Challenge done as challenged for litebox company. "
      }
    }
  },
  "footer": {
    "copyright": "Federico Avelin ® {year}"
  }
}
