{
  "header": {
    "navlinks": {
      "home": "Inicio",
      "about": "Sobre Mi",
      "technologies": "Tecnologías",
      "projects": "Proyectos",
      "contact": "Contacto"
    }
  },
  "home": {
    "title": "Federico Avelin",
    "subtitle": "Desarrollador Web Fullstack",
    "description": "Apasionado por construir software de calidad. Mi enfoque se centra en la arquitectura sólida, código limpio y la entrega de valor tangible a través de tecnología web moderna.",
    "chat": "Conversemos"
  },
  "about": {
    "title": "Sobre mi",
    "description": "¡Hola! Soy Federico, un desarrollador web full-stack con {years} años de experiencia dedicados a construir experiencias web increíbles.\n\nMe encanta transformar ideas en realidad digital, prestando especial atención a la calidad del código y la usabilidad. Trabajo cómodamente con HTML, CSS, TypeScript, React, Next.js y Tailwind CSS, y disfruto mucho descubriendo y utilizando nuevas herramientas que mejoren mi trabajo.\n\nSi tienes un proyecto en mente, ¡me encantaría conversar y ver cómo puedo ayudarte a hacerlo realidad!.",
    "downloadCv": "Descargar CV"
  },
  "technologies": {
    "title": "Tecnologías",
    "categories": {
      "coreWeb": "Core Web & Styling",
      "javascriptEcosystem": "Javascript Ecosystem & Libraries",
      "backend": "Backend & Fullstack",
      "tools": "Development Tools & Environment"
    },
    "icons": {
      "css": "CSS",
      "docker": "Docker",
      "express": "Express",
      "git": "Git",
      "html": "HTML",
      "javascript": "JavaScript",
      "linux": "Linux",
      "materialUI": "Material UI",
      "nextjs": "Next.js",
      "node": "Node.js",
      "npm": "npm",
      "postgresql": "PostgreSQL",
      "postman": "Postman",
      "pwa": "PWA",
      "react": "React",
      "reactHookForm": "React Hook Form",
      "styledComponents": "Styled Components",
      "tailwind": "Tailwind",
      "tanstack": "Tanstack",
      "typescript": "TypeScript",
      "vite": "Vite"
    }
  },
  "contact": {
    "title": "Contáctame",
    "info": {
      "location": "Rosario, Santa Fe, Argentina",
      "email": "fede.avelin.dev@gmail.com",
      "github": "github.com/fedex159",
      "linkedin": "linkedin.com/in/federico-avelin-dev/"
    },
    "form": {
      "fullName": "Nombre Completo*",
      "email": "Email*",
      "subject": "Asunto*",
      "message": "Mensaje*",
      "submit": "Enviar"
    }
  },
  "projects": {
    "title": "Proyectos",
    "links": {
      "repository": "Repositorio",
      "website": "Sitio Web"
    },
    "items": {
      "webService": {
        "title": "Web Service",
        "description": "Es un e-commerce final de carrera para conectar oferta y demanda de servicios (plomería, clases, etc.). Lideré el equipo en la organización y desarrollo del proyecto.\n\nOfrece publicación de servicios, sistema de calificaciones, carrito de compras con pagos (MercadoPago/PayPal) y chat en tiempo real. Incluye paneles de usuario y administrador con estadísticas.\n\nDesarrollado con React, Express, PostgreSQL y Material UI, implementamos funcionalidades completas incluyendo autenticación. Es un proyecto de estudio totalmente funcional."
      },
      "videogames": {
        "title": "Videogames",
        "description": "Fue un proyecto individual de fin de carrera que consistió en el desarrollo de una aplicación web para la búsqueda y gestión de videojuegos.\n\nOfrece búsqueda y filtrado de videojuegos (con la API de RAWG), creación de nuevos videojuegos, paginación y página de detalle. También es responsive.\n\nDesarrollado con React, Express y PostgreSQL, este proyecto individual fue crucial para mi aprendizaje full-stack y la integración de APIs como la de RAWG."
      },
      "snake": {
        "title": "Snake React",
        "description": "Es una recreación del clásico videojuego de la Serpiente, desarrollada como un desafío personal para explorar las capacidades de React en la creación de lógica de juegos interactivos.\n\nOfrece tres niveles de dificultad, efectos de sonido y es totalmente responsive, funcionando en escritorio y dispositivos móviles con controles táctiles o botones.\n\nCon un diseño simple, el foco principal fue la desafiante implementación de la lógica del juego en React, resultando en una valiosa experiencia de aprendizaje."
      },
      "gifs": {
        "title": "Gif Finder",
        "description": "App de Gifs. Algunas de las funciones principales son: búsqueda de GIF, selector de color, agregar a favoritos, carrusel."
      },
      "porfolio": {
        "title": "Portfolio",
        "description": "Mi portfolio personal. Hecho con React y Typescript. Encontraran mi información personal, proyectos y tecnologías."
      },
      "liteflix": {
        "title": "Liteflix",
        "description": "Catalogo de películas dinámico. Challenge hecho como desafió para la empresa litebox."
      }
    }
  },
  "footer": {
    "copyright": "Federico Avelin ® {year}"
  }
}
